<template>
  <div id="lineChart"><p>全国白酒产量月增长率</p></div>
</template>
<script src="https://code.jquery.com/jquery-3.4.1.min.js"></script>
<script>
import { View } from "@antv/data-set";
import { Chart } from "@antv/g2";
export default {
  name: "lineChart",
  data() {
    return {
      lineChartdata: "",
    };
  },
  mounted() {
    this.initlineChart();
  },
  methods: {
    initlineChart: function() {
      // 图表的宽度和高度
      //
      // 数据导入，将csv数据变为dataset格式，time表示时间，product表示产量
      const csv_product = `time,product
2021年5月,11.7
2021年4月,17
2021年3月,22.5
2021年2月,18.9
2020年12月,-2.5
2020年11月,-10.3
2020年10月,-10.4
2020年9月,-10.4
2020年8月,-11.1
2020年7月,-8.7
2020年6月,-8.6
2020年5月,-9.7
2020年4月,-11.9
2020年3月,-15.9
2020年2月,-16.9
2019年12月,-0.8
2019年11月,0.5
2019年10月,1.4
2019年9月,-1.8
2019年8月,1.3
2019年7月,1.1
2019年6月,2.2
2019年5月,0.4
2019年4月,1.1
2019年3月,0.2
2019年2月,-0.9
2018年12月,3.1
2018年11月,2
2018年10月,1.5
2018年9月,4
2018年8月,2.2
2018年7月,3.3
2018年6月,5.8
2018年5月,7.4
2018年4月,6.9
2018年3月,7.5
2018年2月,8.3
2017年12月,6.9
2017年11月,6.3
2017年10月,5.6
2017年9月,6.1
2017年8月,6
2017年7月,6.6
2017年6月,6.6
2017年5月,3.8
2017年4月,3.7
2017年3月,2.8
2017年2月,2.6
2016年12月,3.2
2016年11月,3.2
2016年10月,3.4
2016年9月,4.3
2016年8月,4.6
2016年7月,4.4
2016年6月,4.9
2016年5月,5.9
2016年4月,5.3
2016年3月,6.7
2016年2月,5.6
2015年12月,5.1
2015年11月,5
2015年10月,4.8
2015年9月,5.6
2015年8月,3.8
2015年7月,4.7
2015年6月,3.5
2015年5月,3.3
2015年4月,3.6
2015年3月,4.2
2015年2月,4.6
2014年12月,2.7
2014年11月,3.5
2014年10月,4.6
2014年9月,5.4
2014年8月,6.7
2014年7月,7.1
2014年6月,7
2014年5月,7.3
2014年4月,9.1
2014年3月,5.7
2014年2月,4.4
2013年12月,7.1
2013年11月,7.4
2013年10月,7.4
2013年9月,7
2013年8月,7.9
2013年7月,8.4
2013年6月,9.2
2013年5月,8.45
2013年4月,6.94
2013年3月,7.85
2013年2月,8.5
2012年12月,18.5
2012年11月,17.7
2012年10月,19.3
2012年9月,20.7
2012年8月,20.5
2012年7月,19.7
2012年6月,17.1
2012年5月,17.5
2012年4月,17.3
2012年3月,23
2012年2月,31.9
2012年1月,15.08
2011年12月,30.7
2011年11月,30.2
2011年10月,29.9
2011年9月,29.2
2011年8月,29.7
2011年7月,28.8
2011年6月,28
2011年5月,30.3
2011年4月,27.7
2011年3月,27.3
2011年2月,25.2
2011年1月,27.91
2010年12月,26.7
2010年11月,26.9
2010年10月,26.63
2010年9月,28.3
2010年8月,27.1
2010年7月,26.3
2010年6月,29.4
2010年5月,30.6
2010年4月,29.9
2010年3月,27.5
2010年2月,30.84
2010年1月,32.85
2009年12月,23.8
2009年11月,22.2
2009年10月,24
2009年9月,23.5
2009年8月,21.6
2009年7月,21.46
2009年6月,20.06
2009年5月,17.4
2009年4月,20.8
2009年3月,18.5
2009年2月,20.2
2009年1月,17.33
2008年12月,15.8
2008年11月,16
2008年10月,17.1
2008年9月,16.5
2008年8月,17.9
2008年7月,18.9
2008年6月,18.9
2008年5月,18.8
2008年4月,17.7
2008年3月,19.2
2008年2月,21.1
2008年1月,23.26
2007年12月,22.2
2007年11月,23
2007年10月,23.3
2007年9月,22.5
2007年8月,19.4
2007年7月,17.8
2007年6月,17.1
2007年5月,16.4
2007年4月,16.4
2007年3月,16.4
2007年2月,12.7
2007年1月,6.52
2006年12月,18.2
2006年11月,17.9
2006年10月,17.7
2006年9月,17.7
2006年8月,20.9
2006年7月,21.4
2006年6月,21.1
2006年5月,18.6
2006年4月,16.35
2006年3月,13.1
2006年2月,19
2006年1月,19.17
2005年12月,15
2005年11月,16.8
2005年10月,16.5
2005年9月,15.8
2005年8月,15.6
2005年7月,14.6
2005年6月,14.2
2005年5月,14.6
2005年4月,12.4
2005年3月,13.9
2005年2月,15.3
2005年1月,19.9
2004年12月,2
2004年11月,3
2004年10月,3.8
2004年9月,3.3
2004年8月,-20.3
2004年7月,-19.5
2004年6月,-18.7
2004年5月,-18.6
2004年4月,-18.7
2004年3月,-1.3
2004年2月,-1.4
2004年1月,9.1
2003年12月,2.04
2003年11月,2.4
2003年10月,1.63
2003年9月,0.86
2003年8月,-0.35
2003年7月,-2.41
2003年6月,-2.35
2003年5月,-4.87
2003年4月,-3.78
2003年3月,-4.59
2003年2月,-4.57
2003年1月,-7.88
2002年12月,-6.08
2002年11月,-7.99
2002年10月,-8.59
2002年9月,-9.33
2002年8月,-10.44
2002年7月,-11.68
2002年6月,-12.34
2002年5月,-12.7
2002年4月,-11.99
2002年3月,-9.9
2002年2月,-8.39
2002年1月,-12.15
2001年12月,-9.3
2001年11月,-8.8
2001年10月,-6.64
2001年9月,-7.03
2001年8月,-5.29
2001年7月,-3.7
2001年6月,-3.53
2001年5月,-4.01
2001年4月,-5.3
2001年3月,-6.2
2001年2月,-9
2001年1月,-2.9
2000年12月,1.1
2000年11月,1.5
2000年10月,1.4
2000年9月,1.2
2000年8月,1.2
2000年7月,0.3
2000年6月,1
2000年5月,-0.1
2000年4月,-1.2
1999年12月,1.9
1999年11月,2.31
1999年10月,2.8
1999年9月,5.43
1999年8月,5.78
1999年7月,5.43
1999年6月,5.51
1999年5月,6.82
1999年4月,9.56
1999年3月,13.1
1999年2月,12.4
1999年1月,9.22
1998年6月,-10.1
1998年5月,-11.2
1998年4月,-11.6
1998年3月,-12.3
1998年2月,-16.3
1998年1月,-7.5
1997年12月,2.5
1997年11月,3.4
1997年10月,4.4
1997年9月,5.4
1997年8月,4.7
1997年7月,5.5
1997年6月,4.6
1997年5月,5.4
1997年4月,3
1997年3月,-3.9
1997年2月,-95.6
1997年1月,4.3
1995年12月,11.26
1995年11月,11.5
1995年10月,11.23
1995年9月,12.16
1995年8月,11.38
1995年7月,9.95
1995年6月,10.44
1995年5月,9.93
1995年4月,8.14
1995年3月,11.57
1995年2月,3.84
1995年1月,6.03
1993年12月,8.2
1993年11月,7
1993年10月,7.7
1993年9月,7.7
1993年8月,8.2
1993年7月,7.7
1993年6月,7.8
1993年5月,7.2
1993年4月,7.9
1993年3月,5.4
1993年2月,7.5
1993年1月,0.9
1992年12月,5.2
1992年11月,4.5
1992年10月,3.6
1992年9月,3.4
1992年8月,3
1992年7月,2.2
1992年6月,2
1992年5月,2.7
1992年4月,4
1992年3月,4.7
1992年2月,4.9
1992年1月,2
1991年12月,1.5
1991年11月,1.1
1991年10月,1.8
1991年9月,2.5
1991年8月,2.4
1991年7月,2.6
1991年6月,3
1991年5月,3.8
1991年4月,4.7
1991年3月,5.1
1991年2月,5.5
1991年1月,27.6
1990年12月,18
1990年11月,19.9
1990年10月,19.9
1990年9月,19.3
1990年8月,19
1990年7月,18.7
1990年6月,19.3
1990年5月,18
1990年4月,15.3
1990年3月,15.6
1990年2月,11.4
1990年1月,-11.1
1989年12月,-8.6
1989年11月,-10.9
1989年10月,-11.8
1989年9月,-11.6
1989年8月,-11.1
1989年7月,-10.9
1989年6月,-11.5
1989年5月,-10.9
1989年4月,-9.7
1989年3月,-10.5
1989年2月,-7.7
1989年1月,-16.4
`;
      const product = new View().source(csv_product, {
        type: "csv",
      });
      console.log(product); //打印出转换完成后的数据

      for (var i = 0; i < 304; i++) {
        product.rows[i].product = parseFloat(product.rows[i].product); //将字符串转化为浮点数
      }
      //使用G2绘图
      const chart = new Chart({
        title:"全国白酒产量月增长率",
        container: "lineChart", //连接body中的ID
        // height: window.innerHeight,  //高度为窗口高度
        forceFit: true, //自适应模式，若想自定义宽度需改为false
        padding: [ 30, 21, 60, 30], //边框宽度，修改后会影响坐标轴的显示
        top:200,
        width: 540,
        height: 300,
      });
      console.log(product);
      chart.data(product.rows); //导入dataset数据
      chart.scale("product", {
        range: [0, 1],
      }); //定义轴线
      chart.axis("time", {
        label: {
          textStyle: {
            fill: "#FFFFFF",
          },
        },
      }); //定义x轴文字，这里颜色设置为白色，故没有显示出来（太多了，显示出来是杂乱的）
      chart.axis("product", {
        label: {
          textStyle: {
            fill: "#aaaaaa",
          },
        },
      }); //定义y轴文字
      chart
        .line()
        .position("time*product")
        // .shape("smooth"); //绘制曲线，并设为平滑模式
      console.log(chart);
      // chart.point().position('time*product').color('#5ed470').size(1.2); // 绘制点图
      //事件1描述
      // chart.annotation().dataMarker({
      //   top: true,
      //   position: [199502, 3312.93],
      //   lineLength: 200, //设置连接线的高度
      //   // content: "1994年，税制改革\n对白酒同时征收增值税和消费税。",
      //   style: {
      //     text: {
      //       textAlign: "right",
      //       fontSize: 12,
      //       stroke: "white",
      //       lineWidth: 2,
      //       fontWeight: 10,
      //     },
      //     point: {
      //       r: 4,
      //     },
      //     line: {
      //       stroke: "#A3B1BF",
      //       lineWidth: 2,
      //     },
      //   },
      // });
      // //事件2描述
      // chart.annotation().dataMarker({
      //   top: true,
      //   position: ["199803", 3737.81],
      //   lineLength: 180, //设置连接线的高度
      //   content:
      //     "对粮食类白酒的广告宣传费\n一律不得在税前扣除\n白酒行业实际税赋继续加重。",
      //   style: {
      //     text: {
      //       textAlign: "right",
      //       fontSize: 12,
      //       stroke: "white",
      //       lineWidth: 2,
      //       fontWeight: 10,
      //     },
      //     point: {
      //       r: 4,
      //     },
      //     line: {
      //       stroke: "#A3B1BF",
      //       lineWidth: 2,
      //     },
      //   },
      // });
      // //事件3描述
      // chart.annotation().dataMarker({
      //   top: true,
      //   position: ["200105", 8419.81],
      //   lineLength: 150, //设置连接线的高度
      //   content:
      //     "对粮食类白酒\n按实际销量每公斤征收\n0.5元订额消费税,限制小规\n模、生产低档酒企业。",
      //   style: {
      //     text: {
      //       textAlign: "right",
      //       fontSize: 12,
      //       stroke: "white",
      //       lineWidth: 2,
      //       fontWeight: 10,
      //     },
      //     point: {
      //       r: 4,
      //     },
      //     line: {
      //       stroke: "#A3B1BF",
      //       lineWidth: 2,
      //     },
      //   },
      // });
      // //事件4描述
      // chart.annotation().dataMarker({
      //   top: true,
      //   position: ["200603", 10294.16],
      //   lineLength: 150, //设置连接线的高度
      //   content: "粮食白酒比例税升5%\n薯类白酒降5%\n促使企业产品结构调整。",
      //   style: {
      //     text: {
      //       textAlign: "right",
      //       fontSize: 12,
      //       stroke: "white",
      //       lineWidth: 2,
      //       fontWeight: 10,
      //     },
      //     point: {
      //       r: 4,
      //     },
      //     line: {
      //       stroke: "#A3B1BF",
      //       lineWidth: 2,
      //     },
      //   },
      // });
      // //事件5描述
      // chart.annotation().dataMarker({
      //   top: true,
      //   position: ["200802", 10121.81],
      //   lineLength: 250, //设置连接线的高度
      //   content: "企业所得税从33%\n降为25%",
      //   style: {
      //     text: {
      //       textAlign: "right",
      //       fontSize: 12,
      //       stroke: "white",
      //       lineWidth: 2,
      //       fontWeight: 10,
      //     },
      //     point: {
      //       r: 4,
      //     },
      //     line: {
      //       stroke: "#A3B1BF",
      //       lineWidth: 2,
      //     },
      //   },
      // });
      // //事件6描述
      // chart.annotation().dataMarker({
      //   top: true,
      //   position: ["199812", 20554.13],
      //   lineLength: 230, //设置连接线的高度
      //   content: "山西毒酒案的发生\n影响人们饮酒选择。",
      //   style: {
      //     text: {
      //       textAlign: "right",
      //       fontSize: 12,
      //       stroke: "white",
      //       lineWidth: 2,
      //       fontWeight: 10,
      //     },
      //     point: {
      //       r: 4,
      //     },
      //     line: {
      //       stroke: "#A3B1BF",
      //       lineWidth: 2,
      //     },
      //   },
      // });
      // //事件7描述
      // chart.annotation().dataMarker({
      //   top: true,
      //   position: ["201802", 12346.4],
      //   lineLength: 450, //设置连接线的高度
      //   content: "中央提出文化自信理论\n白酒文化得到关注\n白酒产销有所上升",
      //   style: {
      //     text: {
      //       textAlign: "right",
      //       fontSize: 12,
      //       stroke: "white",
      //       lineWidth: 2,
      //       fontWeight: 10,
      //     },
      //     point: {
      //       r: 4,
      //     },
      //     line: {
      //       stroke: "#A3B1BF",
      //       lineWidth: 2,
      //     },
      //   },
      // });
      chart.render(); //渲染，若不渲染，可能会有显示问题

      // //未实现功能
      // // const slider = new Slider({
      // //     container: 'slider',
      // //     product, // !!! 注意是原始数据，不要传入 dv
      // //     xAxis: 'time',
      // //     yAxis: 'product',
      // //     onChange: ({ startText, endText }) => {
      // //         // !!! 更新状态量
      // //         ds.setState('start', startText);
      // //         ds.setState('end', endText);
      // //     }
      // // });
      // // slider.render();
    },
  },
};
</script>
<style>
/* #lineChart {
    position: absolute;
    width: 100%;
    height: 100%;
 } */
</style>
